IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28004x_nmi_intrupt_regs.xml
<module id="NMI_INTRUPT_REGS" HW_revision="" description="NMI INTRUPT Registers">
	<register id="NMICFG" width="16" page="1" offset="0x0" internal="0" description="NMI Configuration Register">
		<bitfield id="NMIE" description="Global NMI Enable" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="NMIFLG" width="16" page="1" offset="0x1" internal="0" description="NMI Flag Register (SYSRsn Clear)">
		<bitfield id="NMIINT" description="NMI Interrupt Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CLOCKFAIL" description="Clock Fail Interrupt Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="RAMUNCERR" description="RAM Uncorrectable Error NMI Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="FLUNCERR" description="Flash Uncorrectable Error NMI Flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="PIEVECTERR" description="PIE Vector Fetch Error Flag" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="CLBNMI" description="Configurable Logic Block NMI Flag" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="SWERR" description="SW Error Force NMI Flag" begin="13" end="13" width="1" rwaccess="R"/>
	</register>
	<register id="NMIFLGCLR" width="16" page="1" offset="0x2" internal="0" description="NMI Flag Clear Register">
		<bitfield id="NMIINT" description="NMIINT Flag Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLOCKFAIL" description="CLOCKFAIL Flag Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RAMUNCERR" description="RAMUNCERR Flag Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FLUNCERR" description="FLUNCERR Flag Clear" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="PIEVECTERR" description="PIEVECTERR Flag Clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CLBNMI" description="CLBNMI Flag Clear" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SWERR" description="SWERR Flag Clear" begin="13" end="13" width="1" rwaccess="RW"/>
	</register>
	<register id="NMIFLGFRC" width="16" page="1" offset="0x3" internal="0" description="NMI Flag Force Register">
		<bitfield id="CLOCKFAIL" description="CLOCKFAIL Flag Force" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="RAMUNCERR" description="RAMUNCERR Flag Force" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FLUNCERR" description="FLUNCERR Flag Force" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="PIEVECTERR" description="PIEVECTERR Flag Force" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CLBNMI" description="CLBNMI Flag Force" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SWERR" description="SWERR Flag Force" begin="13" end="13" width="1" rwaccess="RW"/>
	</register>
	<register id="NMIWDCNT" width="16" page="1" offset="0x4" internal="0" description="NMI Watchdog Counter Register">
		<bitfield id="NMIWDCNT" description="NMI Watchdog Counter" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="NMIWDPRD" width="16" page="1" offset="0x5" internal="0" description="NMI Watchdog Period Register">
		<bitfield id="NMIWDPRD" description="NMI Watchdog Period" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="NMISHDFLG" width="16" page="1" offset="0x6" internal="0" description="NMI Shadow Flag Register">
		<bitfield id="CLOCKFAIL" description="Shadow CLOCKFAIL Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="RAMUNCERR" description="Shadow RAMUNCERR Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="FLUNCERR" description="Shadow FLUNCERR Flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="PIEVECTERR" description="Shadow PIEVECTERR Flag" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="CLBNMI" description="Shadow CLBNMI flag" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="SWERR" description="SW Error Force NMI Flag" begin="13" end="13" width="1" rwaccess="R"/>
	</register>
</module>
